var local_database = [{
    date: "2020/12/12",
    title: "荷塘月色（节选）",
    author: "朱自清",
    datetime: "1927年7月",
    imgSrc: '/images/post/sls.jpg',
    content: '这几天心里颇不宁静。今晚在院子里坐着乘凉，忽然想起日日走过的荷塘，在这满月的光里，总该另有一番样子吧。',
    reading: "100",
    collection: '50',
    postId: 0,
    headImgSrc: "/images/post/sls.jpg",
    
  detail1: "这几天心里颇不宁静。今晚在院子里坐着乘凉，忽然想起日日走过的荷塘，在这满月的光里，总该另有一番样子吧。月亮渐渐地升高了，墙外马路上孩子们的欢笑，已经听不见了；妻在屋里拍着闰儿，迷迷糊糊地哼着眠歌。我悄悄地披了大衫，带上门出去。",
  detail2: "沿着荷塘，是一条曲折的小煤屑路。这是一条幽僻的路；白天也少人走，夜晚更加寂寞。荷塘四面，长着许多树，蓊蓊郁郁的。路的一旁，是些杨柳，和一些不知道名字的树。没有月光的晚上，这路上阴森森的，有些怕人。今晚却很好，虽然月光也还是淡淡的。",
  detail3:"路上只我一个人，背着手踱着。这一片天地好像是我的；我也像超出了平常的自己，到了另一个世界里。我爱热闹，也爱冷静；爱群居，也爱独处。像今晚上，一个人在这苍茫的月下，什么都可以想，什么都可以不想，便觉是个自由的人。白天里一定要做的事，一定要说的话，现 在都可不理。这是独处的妙处，我且受用这无边的荷塘月色好了。",
  detail4:"曲曲折折的荷塘上面，弥望的是田田的叶子。叶子出水很高，像亭亭的舞女的裙。层层的叶子中间，零星地点缀着些白花，有袅娜地开着的，有羞涩地打着朵儿的；正如一粒粒的明珠，又如碧天里的星星，又如刚出浴的美人。微风过处，送来缕缕清香，仿佛远处高楼上渺茫的歌声似的。这时候叶子与花也有一丝的颤动，像闪电般，霎时传过荷塘的那边去了。叶子本是肩并肩密密地挨着，这便宛然有了一道凝碧的波痕。叶子底下是脉脉的流水，遮住了，不能见一些颜色；而叶子却更见风致了。",
  detail5:"月光如流水一般，静静地泻在这一片叶子和花上。薄薄的青雾浮起在荷塘里。叶子和花仿佛在牛乳中洗过一样；又像笼着轻纱的梦。虽然是满月，天上却有一层淡淡的云，所以不能朗照；但我以为这恰是到了好处——酣眠固不可少，小睡也别有风味的。月光是隔了树照过来的，高处丛生的灌木，落下参差的斑驳的黑影，峭楞楞如鬼一般；弯弯的杨柳的稀疏的倩影，却又像是画在荷叶上。塘中的月色并不均匀；但光与影有着和谐的旋律，如梵婀玲上奏着的名曲。",
  detail6:"荷塘的四面，远远近近，高高低低都是树，而杨柳最多。这些树将一片荷塘重重围住；只在小路一旁，漏着几段空隙，像是特为月光留下的。树色一例是阴阴的，乍看像一团烟雾；但杨柳的丰姿，便在烟雾里也辨得出。树梢上隐隐约约的是一带远山，只有些大意罢了。树缝里也漏着一两点路灯光，没精打采的，是渴睡人的眼。这时候最热闹的，要数树上的蝉声与水里的蛙声；但热闹是它们的，我什么也没有。",
  detail7:"忽然想起采莲的事情来了。采莲是江南的旧俗，似乎很早就有，而六朝时为盛；从诗歌里可以约略知道。采莲的是少年的女子，她们是荡着小船，唱着艳歌去的。采莲人不用说很多，还有看采莲的人。那是一个热闹的季节，也是一个风流的季节。梁元帝《采莲赋》里说得好：于是妖童媛女，荡舟心许；鷁首徐回，兼传羽杯；棹将移而藻挂，船欲动而萍开。尔其纤腰束素，迁延顾步；夏始春余，叶嫩花初，恐沾裳而浅笑，畏倾船而敛裾。",
  detail8:"可见当时嬉游的光景了。这真是有趣的事，可惜我们现 在早已无福消受了。",
  detail9:"于是又记起，《西洲曲》里的句子：采莲南塘秋，莲花过人头；低头弄莲子，莲子清如水。",
  detail10:"今晚若有采莲人，这儿的莲花也算得“过人头”了；只不见一些流水的影子，是不行的。这令我到底惦着江南了。——这样想着，猛一抬头，不觉已是自己的门前；轻轻地推门进去，什么声息也没有，妻已睡熟好久了。",
  detail11:"一九二七年七月，北京清华园。",
  },

  {
    date: "2020/12/12",
    title: "复仇",
    imgSrc: '/images/post/b.jpg',
    content: '然而他们俩对立着，在广漠的旷野之上，裸着全身，捏着利刃，然而也不拥抱，也不杀戮，而且也不见有拥抱或杀戮之意。',
    reading: "120",
    collection: '150',
    postId: 1,
    headImgSrc: "/images/post/b.jpg",
    author: "鲁迅",
    datetime: "一九二四年十二月二十九日",
    detail: "人的皮肤之厚，大概不到半分，鲜红的热血，就循着那后面，在比密密层层地爬在墙壁上的槐蚕更其密的血管里奔流，散出温热。于是各以这温热互相蛊惑，煽动，牵引，拚命地希求偎倚，接吻，拥抱，以得生命的沉酣的大欢喜。",
    detail2: "但倘若用一柄尖锐的利刃，只一击，穿透这桃红色的，菲薄的皮肤，将见那鲜红的热血激箭似的以所有温热直接灌溉杀戮者；其次，则给以冰冷的呼吸，示以淡白的嘴唇，使之人性茫然，得到生命的飞扬的极致的大欢喜；而其自身，则永远沉浸于生命的飞扬的极致的大欢喜中。",
    detail3:"这样，所以，有他们俩裸着全身，捏着利刃，对立于广漠的旷野之上。",
    detail4:"他们俩将要拥抱，将要杀戮……路人们从四面奔来，密密层层地，如槐蚕爬上墙壁，如马蚁要扛鲞头。衣服都漂亮，手倒空的。然而从四面奔来，而且拚命地伸长颈子，要赏鉴这拥抱或杀戮。他们已经豫觉着事后的自己的舌上的汗或血的鲜味。",
    detail5:"然而他们俩对立着，在广漠的旷野之上，裸着全身，捏着利刃，然而也不拥抱，也不杀戮，而且也不见有拥抱或杀戮之意。",
    detail6:"他们俩这样地至于永久，圆活的身体，已将干枯，然而毫不见有拥抱或杀戮之意。",
    detail7:"路人们于是乎无聊；觉得有无聊钻进他们的毛孔，觉得有无聊从他们自己的心中由毛孔钻出，爬满旷野，又钻进别人的毛孔中。他们于是觉得喉舌干燥，脖子也乏了；终至于面面相觑，慢慢走散；甚而至于居然觉得干枯到失了生趣。",
    detail8:"于是只剩下广漠的旷野，而他们俩在其间裸着全身，捏着利刃，干枯地立着；以死人似的眼光，赏鉴这路人们的干枯，无血的大戮，而永远沉浸于生命的飞扬的极致的大欢喜中。",
    detail9:"一九二四年十二月二十日。",
  },

  {
    date: "2020/12/12",
    title: "秋雨",
    imgSrc: '/images/post/c.jpg',
    content: '雨，像银灰色粘濡的蛛丝，织成一片轻柔的网，网住了整个秋的世界。',
    reading: "80",
    collection: '50',
    postId: 2,
    headImgSrc: "/images/post/c.jpg",
    author: "张爱玲",
    datetime: "1944年",
    detail: "雨，像银灰色粘湿的蛛丝，织成一片轻柔的网，网住了整个秋的世界。天也是暗沉沉的，像古老的住宅里缠满着蛛丝网的屋顶。那堆在天上的灰白色的云片，就像屋顶上剥落的白粉。在这古旧的屋顶的笼罩下，一切都是异常的沉闷。园子里绿翳翳的石榴，桑树，葡萄藤，都不过代表着过去盛夏的繁荣，现在已成了古罗马建筑的遗迹一样，在萧萧的雨声中瑟缩不宁，回忆着光荣的过去。草色已经转入忧郁的苍黄，地下找不出一点新鲜的花朵；宿舍墙外一带种的娇嫩的洋水仙，垂了头，含着满眼的泪珠，在那里叹息它们的薄命，才过了两天的晴美的好日子又遇到这样霉气熏蒸的雨天。只有墙角的桂花，枝头已经缀着几个黄金一样宝贵的嫩蕊，小心地隐藏在绿油油椭圆形的叶瓣下，透露出一点新生命萌芽的希望。",
    detail2:"雨静悄悄地下着，只有一点细细的淅沥沥的声音。桔红色的房屋，像披着鲜艳的袈裟的老僧，垂头合目，受着雨的洗礼。那潮湿的红砖，发出有刺激性的猪血的颜色和墙下绿油油的桂叶成为强烈的对照。灰色的癞蛤蟆，在湿烂发霉的泥地里跳跃着；在秋雨的沉闷的网底，只有它是唯一的充满愉快的生气的东西。它背上灰黄斑驳的花纹，跟沉闷的天空遥遥相应，造成和谐的色调。它扑通扑通的跳着，从草窠里，跳到泥里，溅出深绿的水花。",
    detail3:"雨，像银灰色粘濡的蛛丝，织成一片轻柔的网，网住了整个秋的世界。",}

]

module.exports = {
  postlist: local_database
}